# Series Object in Pandas

In [6]:
import pandas as pd
data =[1,2,3,4,5,6]
series1 = pd.Series(data)
series1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [ ]:
### How to check the type of the object

In [5]:
type(series1)

pandas.core.series.Series

In [ ]:
### How to change the index names in the above series - replace 0,1,2,3 to abcdef

In [8]:
series1 = pd.Series(data, index = ['a','b','c','d','e','f'])
series1

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

# 2D label data - DataFrames
## different column types, mutable size, labeled axes, arithmetic

In [9]:
import pandas as pd
data =[1,2,3,4,5,6]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [11]:
#Creating a dataframe using dictionary
dictionary = {'fruits':['apples','banana','mangoes'], 'count':[10,20,15], 'price':[1,2,3]}
df = pd.DataFrame(dictionary)
df

    fruits  count  price
0   apples     10      1
1   banana     20      2
2  mangoes     15      3

In [12]:
#creating a dataframe using series
#converted 1 dimentional to 2D i.e. from series to dataframe
series = pd.Series([6,12], index = ['a','b'])
df = pd.DataFrame(series)
df

    0
a   6
b  12

In [14]:
## merge, join and contcatenation on dataframe
import pandas as pd
player = ['Player1', 'Player2', 'Player3']
point=[8,9,6]
title=['Game1','Game2','Game3']

df1=pd.DataFrame({'Player':player, 'Points':point, 'Title':title})
df1

    Player  Points  Title
0  Player1       8  Game1
1  Player2       9  Game2
2  Player3       6  Game3

In [15]:
player = ['Player1', 'Player5', 'Player6']
power=['Punch','Kick','Elbow']
title=['Game1','Game5','Game6']

df2=pd.DataFrame({'Player':player, 'Power':power, 'Title':title})
df2

    Player  Power  Title
0  Player1  Punch  Game1
1  Player5   Kick  Game5
2  Player6  Elbow  Game6

In [16]:
#inner merge
df1.merge(df2, on='Title', how='inner')

  Player_x  Points  Title Player_y  Power
0  Player1       8  Game1  Player1  Punch